Repository: Chamotrans/codex-claude-session-sync
Catalog: Sources/SessionSync/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

source: %@: already in the sidebar.
zh_hans: %@：侧栏中已存在。
zh_hant: %@：側欄已經有。

source: %@: already up to date.
zh_hans: %@：已是最新。
zh_hant: %@：已經係最新。

source: %lld s
zh_hans: %lld 秒
zh_hant: %lld 秒

source: %lld turns · %@
zh_hans: %lld 回合 · %@
zh_hant: %lld 回合 · %@

source: (untitled)
zh_hans: (无标题)
zh_hant: (無標題)

source: Activity
zh_hans: 活动记录
zh_hant: 活動記錄

source: Add conversations that came from Codex to the Claude desktop sidebar (other CLI sessions can be registered one by one from the context menu)
zh_hans: 将来自 Codex、但 Claude 桌面版侧栏中没有的对话登记到侧栏（其他 CLI 对话可在右键菜单中逐个登记）
zh_hant: 將由 Codex 同步過嚟、但 Claude Desktop 側欄未有嘅對話登記到側欄（其他 CLI 對話可以逐個喺右鍵選單登記）

source: Add to Claude Desktop Sidebar
zh_hans: 登记到 Claude 桌面版侧栏
zh_hant: 登記到 Claude Desktop 側欄

source: Add to Sidebar
zh_hans: 登记到侧栏
zh_hant: 登記到側欄

source: Added %lld conversations to the Claude desktop sidebar. Restart the Claude app if they do not appear.
zh_hans: 已将 %lld 个对话登记到 Claude 桌面版侧栏。如未显示请重启 Claude app。
zh_hant: 已登記 %lld 個對話到 Claude Desktop 側欄。如未出現請重開 Claude app。

source: Added to the Claude desktop sidebar: %@. Restart the Claude app if it does not appear.
zh_hans: 已登记到 Claude 桌面版侧栏：%@。如未显示请重启 Claude app。
zh_hant: 已登記到 Claude Desktop 側欄：%@。如未出現請重開 Claude app。

source: Adding all to the Claude desktop sidebar…
zh_hans: 全部登记到 Claude 桌面版…
zh_hant: 登記全部到 Claude Desktop…

source: Adding to the Claude desktop sidebar…
zh_hans: 登记到 Claude 桌面版…
zh_hant: 登記到 Claude Desktop…

source: All
zh_hans: 全部
zh_hant: 全部

source: All Claude conversations are already in the sidebar.
zh_hans: 所有 Claude 对话都已在侧栏中。
zh_hant: 所有 Claude 對話都已經喺側欄。

source: Auto Sync
zh_hans: 自动同步
zh_hant: 自動同步

source: Auto sync
zh_hans: 自动同步
zh_hant: 自動同步

source: Auto sync on
zh_hans: 自动同步已开启
zh_hant: 自動同步開啟

source: Auto sync skipped %@: %@
zh_hans: 自动同步跳过 %@：%@
zh_hant: 自動同步略過 %@：%@

source: Auto sync: %@
zh_hans: 自动同步：%@
zh_hant: 自動同步：%@

source: Auto-created a Claude copy: %@
zh_hans: 自动创建 Claude 副本：%@
zh_hant: 自動建立 Claude 副本：%@

source: Auto-created a Codex copy: %@
zh_hans: 自动创建 Codex 副本：%@
zh_hant: 自動建立 Codex 副本：%@

source: Besides the timer, the app watches ~/.claude/projects and ~/.codex/sessions and rescans a few seconds after files change. Conflicts and open conversations are never synced automatically.
zh_hans: 除定时扫描外，app 还会监听 ~/.claude/projects 和 ~/.codex/sessions 的文件变动，有更新时会延迟几秒自动扫描。冲突和正在使用的对话永远不会自动同步。
zh_hant: 除咗定時掃描，app 亦會監察 ~/.claude/projects 同 ~/.codex/sessions 嘅檔案變動，有更新會延遲幾秒自動掃描。衝突同使用中嘅對話永遠唔會自動同步。

source: Both sides deleted
zh_hans: 两边均已删除
zh_hant: 兩邊已刪除

source: Both sides have new turns
zh_hans: 两边都有新回合
zh_hant: 兩邊都有新回合

source: Both sides have new turns (Claude %lld, Codex %lld)
zh_hans: 两边都有新回合（Claude %lld、Codex %lld）
zh_hant: 兩邊都有新回合（Claude %lld、Codex %lld）

source: Cancel
zh_hans: 取消
zh_hant: 取消

source: Claude %lld turns · Codex %lld turns
zh_hans: Claude %lld 回合 · Codex %lld 回合
zh_hant: Claude %lld 回合 · Codex %lld 回合

source: Claude copy created by this app
zh_hans: 由本 app 创建的 Claude 副本
zh_hant: 由本 app 建立嘅 Claude 副本

source: Claude has %lld new turns not yet in Codex
zh_hans: Claude 有 %lld 个新回合尚未推送到 Codex
zh_hant: Claude 有 %lld 個新回合未推去 Codex

source: Claude newer
zh_hans: Claude 较新
zh_hant: Claude 較新

source: Claude side deleted
zh_hans: Claude 已删除
zh_hant: Claude 已刪除

source: Claude → Codex %lld turns
zh_hans: Claude → Codex %lld 个回合
zh_hant: Claude → Codex %lld 個回合

source: Clear
zh_hans: 清除
zh_hant: 清除

source: Close
zh_hans: 关闭
zh_hant: 關閉

source: Codex Desktop imported this conversation again. The original is already synced, so this copy is never synced or copied. You can archive it in Codex.
zh_hans: 这是 Codex Desktop 重复导入的副本，原对话已在同步中，不会再同步或复制。可以在 Codex 中归档。
zh_hant: 呢個係 Codex Desktop 重複匯入嘅副本，原本嘅對話已經同步緊，唔會再同步或者複製。可以喺 Codex 封存。

source: Codex auto-imported the Claude conversation
zh_hans: Codex 自动导入 Claude 对话
zh_hant: Codex 自動匯入 Claude 對話

source: Codex copy created by this app
zh_hans: 由本 app 创建的 Codex 副本
zh_hant: 由本 app 建立嘅 Codex 副本

source: Codex has %lld new turns not yet in Claude
zh_hans: Codex 有 %lld 个新回合尚未推送到 Claude
zh_hant: Codex 有 %lld 個新回合未推去 Claude

source: Codex newer
zh_hans: Codex 较新
zh_hant: Codex 較新

source: Codex side deleted
zh_hans: Codex 已删除
zh_hant: Codex 已刪除

source: Codex → Claude %lld turns
zh_hans: Codex → Claude %lld 个回合
zh_hant: Codex → Claude %lld 個回合

source: Conflict
zh_hans: 冲突
zh_hant: 衝突

source: Conflict %lld/%lld
zh_hans: 冲突 %lld/%lld
zh_hant: 衝突 %lld/%lld

source: Conflicts
zh_hans: 冲突
zh_hant: 衝突

source: Conversation
zh_hans: 对话
zh_hant: 對話

source: Copied command: %@
zh_hans: 已复制命令：%@
zh_hant: 已複製指令：%@

source: Copy Claude Resume Command
zh_hans: 复制 Claude resume 命令
zh_hant: 複製 Claude resume 指令

source: Copy Codex Resume Command
zh_hans: 复制 Codex resume 命令
zh_hant: 複製 Codex resume 指令

source: Copy Resume Command
zh_hans: 复制 resume 命令
zh_hant: 複製 resume 指令

source: Could not read the engine output: %@
zh_hans: 解析引擎输出失败：%@
zh_hant: 解析引擎輸出失敗：%@

source: Could not start the engine: %@
zh_hans: 无法启动引擎：%@
zh_hant: 無法啟動引擎：%@

source: Create Claude Copy
zh_hans: 在 Claude 创建副本
zh_hant: 喺 Claude 建立副本

source: Create Codex Copy
zh_hans: 在 Codex 创建副本
zh_hant: 喺 Codex 建立副本

source: Create a copy of this conversation on the other side
zh_hans: 在另一边创建此对话的副本
zh_hant: 喺另一邊建立呢個對話嘅副本

source: Create counterparts for one-sided conversations automatically
zh_hans: 自动为只有一边的对话创建副本
zh_hant: 自動為只有一邊嘅對話建立副本

source: Created a Claude copy: %@
zh_hans: 已在 Claude 创建副本：%@
zh_hant: 已喺 Claude 建立副本：%@

source: Created a Codex copy: %@
zh_hans: 已在 Codex 创建副本：%@
zh_hant: 已喺 Codex 建立副本：%@

source: Creating copy: %@
zh_hans: 创建副本：%@
zh_hant: 建立副本：%@

source: Each side gets the other side's new turns. Both end up complete, only the order differs.
zh_hans: 两边都会补上对方的新回合，内容完整，只是顺序不同。
zh_hant: 兩邊都會補上對方嘅新回合，兩邊內容都齊，只係次序唔同。

source: Engine
zh_hans: 引擎
zh_hant: 引擎

source: Engine error (%lld): %@
zh_hans: 引擎错误 (%lld)：%@
zh_hant: 引擎錯誤 (%lld)：%@

source: Engine in use
zh_hans: 当前使用的引擎
zh_hant: 目前使用引擎

source: Everything is in sync; nothing to push.
zh_hans: 全部已同步，无需推送。
zh_hant: 全部已同步，冇嘢要推。

source: Folder
zh_hans: 目录
zh_hant: 目錄

source: Hidden: %@
zh_hans: 已隐藏：%@
zh_hant: 已隱藏：%@

source: Hide
zh_hans: 隐藏
zh_hant: 隱藏

source: Hide This Conversation
zh_hans: 隐藏此对话
zh_hant: 隱藏呢個工作階段

source: Hiding…
zh_hans: 隐藏中…
zh_hant: 隱藏…

source: In sync
zh_hans: 已同步
zh_hant: 已同步

source: Keep Claude
zh_hans: 以 Claude 为准
zh_hant: 以 Claude 為準

source: Keep Codex
zh_hans: 以 Codex 为准
zh_hant: 以 Codex 為準

source: Last scan %@
zh_hans: 上次扫描 %@
zh_hant: 上次掃描 %@

source: Last sync
zh_hans: 上次同步
zh_hant: 上次同步

source: Linked manually
zh_hans: 手动配对
zh_hant: 手動配對

source: Linked: %@ ↔ %@
zh_hans: 已配对：%@ ↔ %@
zh_hant: 已配對：%@ ↔ %@

source: Linking…
zh_hans: 配对中…
zh_hant: 配對中…

source: Merge both (recommended)
zh_hans: 合并两边（推荐）
zh_hant: 合併兩邊（建議）

source: Needs rebase
zh_hans: 需重设基准
zh_hant: 需重設基準

source: Needs sync
zh_hans: 待同步
zh_hant: 待同步

source: Neither side exists any more. Unlink the pair.
zh_hans: 两边都已不存在，建议解除配对。
zh_hant: 兩邊都搵唔到，建議解除配對。

source: Newer
zh_hans: 较新
zh_hant: 較新

source: No usable python3 found. Install the Xcode Command Line Tools (run xcode-select --install in Terminal) or Homebrew Python (brew install python), then set the python3 path in Settings.
zh_hans: 找不到可用的 python3。请安装 Xcode Command Line Tools（在终端执行 xcode-select --install）或 Homebrew Python（brew install python），然后在设置中填写 python3 路径。
zh_hant: 搵唔到可用嘅 python3。請安裝 Xcode Command Line Tools（喺 Terminal 執行 xcode-select --install）或者 Homebrew Python（brew install python），然後喺設定填 python3 路徑。

source: Not in %@ yet
zh_hans: %@ 中还没有此对话
zh_hant: %@ 度未有呢個對話

source: Not in the Claude desktop sidebar
zh_hans: 不在 Claude 桌面版侧栏中
zh_hant: 未喺 Claude Desktop 側欄

source: Not in the Claude desktop sidebar (open it with claude --resume)
zh_hans: 未登记到 Claude 桌面版侧栏（只能通过 claude --resume 打开）
zh_hant: Claude Desktop 側欄未登記（只可經 claude --resume 開啟）

source: Not yet synced
zh_hans: 未同步
zh_hant: 未同步

source: Nothing, both sides match
zh_hans: 无，两边一致
zh_hant: 冇，兩邊一樣

source: One side has fewer turns than the baseline; the next sync re-bases it
zh_hans: 有一边的回合数少于基准，同步时会重设
zh_hant: 有一邊嘅回合數少過基準，同步時會重設

source: One side missing
zh_hans: 缺少一边
zh_hant: 缺少一邊

source: Only Claude's new turns go to Codex. Codex's new turns stay in Codex.
zh_hans: 只把 Claude 的新回合推送到 Codex；Codex 的新回合留在 Codex。
zh_hant: 只將 Claude 嘅新回合推去 Codex；Codex 嘅新回合會留喺 Codex。

source: Only Codex's new turns go to Claude. Claude's new turns stay in Claude.
zh_hans: 只把 Codex 的新回合推送到 Claude；Claude 的新回合留在 Claude。
zh_hant: 只將 Codex 嘅新回合推去 Claude；Claude 嘅新回合會留喺 Claude。

source: Only in Claude
zh_hans: 仅 Claude
zh_hant: 只有 Claude

source: Only in Codex
zh_hans: 仅 Codex
zh_hant: 只有 Codex

source: Open
zh_hans: 使用中
zh_hant: 使用中

source: Paired
zh_hans: 已配对
zh_hant: 已配對

source: Paired via
zh_hans: 配对来源
zh_hant: 配對來源

source: Pairing…
zh_hans: 正在配对…
zh_hant: 正在配對…

source: Push newer turns automatically after every scan
zh_hans: 每次扫描后自动推送较新的回合
zh_hant: 每次掃描後自動推送較新嘅回合

source: Python in use
zh_hans: 当前使用的 Python
zh_hant: 目前使用 Python

source: Re-import
zh_hans: 重复导入
zh_hant: 重複匯入

source: Re-imports
zh_hans: 重复导入
zh_hant: 重複匯入

source: Ready
zh_hans: 就绪
zh_hant: 就緒

source: Rebuild the deleted side from the side that still exists
zh_hans: 从仍存在的一边重建被删除的一边
zh_hant: 由仲存在嗰邊重新建立被刪除嗰邊

source: Recreate
zh_hans: 重建
zh_hant: 重建

source: Recreate Claude Copy
zh_hans: 重建 Claude 副本
zh_hant: 重建 Claude 副本

source: Recreate Codex Copy
zh_hans: 重建 Codex 副本
zh_hant: 重建 Codex 副本

source: Recreated in Claude: %@
zh_hans: 已在 Claude 重建：%@
zh_hant: 已喺 Claude 重建：%@

source: Recreated in Codex: %@
zh_hans: 已在 Codex 重建：%@
zh_hant: 已喺 Codex 重建：%@

source: Recreating the missing side…
zh_hans: 重建缺少的一边…
zh_hant: 重建缺少嘅一邊…

source: Register Sidebar
zh_hans: 登记侧栏
zh_hant: 登記側欄

source: Register Sidebar (%lld)
zh_hans: 登记侧栏 (%lld)
zh_hant: 登記側欄 (%lld)

source: Rescan
zh_hans: 重新扫描
zh_hant: 重新掃描

source: Resolve
zh_hans: 解决
zh_hant: 解決

source: Resolve Conflict…
zh_hans: 解决冲突…
zh_hant: 解決衝突…

source: Same id (imported by codex2claude)
zh_hans: 相同 ID（由 codex2claude 导入）
zh_hant: 同一 ID（由 codex2claude 匯入）

source: Scan interval
zh_hans: 扫描间隔
zh_hant: 掃描間隔

source: Scanning for the first time…
zh_hans: 首次扫描中…
zh_hant: 首次掃描中…

source: Scanning…
zh_hans: 正在扫描…
zh_hant: 正在掃描…

source: Search titles or projects
zh_hans: 搜索标题或项目
zh_hant: 搜尋標題或項目

source: Select a conversation
zh_hans: 选择一个对话
zh_hant: 揀一個工作階段

source: Show Claude File in Finder
zh_hans: 在 Finder 中显示 Claude 文件
zh_hant: 喺 Finder 顯示 Claude 檔案

source: Show Codex File in Finder
zh_hans: 在 Finder 中显示 Codex 文件
zh_hant: 喺 Finder 顯示 Codex 檔案

source: Since the last sync, Claude gained %lld turns and Codex gained %lld. How do you want to resolve it?
zh_hans: 自上次同步后，Claude 新增了 %lld 个回合，Codex 新增了 %lld 个回合。你想如何处理？
zh_hant: 自上次同步後，Claude 多咗 %lld 個回合，Codex 多咗 %lld 個回合。你想點處理？

source: Size
zh_hans: 大小
zh_hant: 大小

source: Status
zh_hans: 状态
zh_hant: 狀態

source: Sync
zh_hans: 同步
zh_hant: 同步

source: Sync All
zh_hans: 全部同步
zh_hant: 同步全部

source: Sync Now
zh_hans: 立即同步
zh_hant: 立即同步

source: Sync baseline
zh_hans: 同步基准
zh_hant: 同步基準

source: Sync status
zh_hans: 同步状态
zh_hant: 同步狀態

source: Syncing all…
zh_hans: 全部同步中…
zh_hant: 同步全部…

source: Syncing: %@
zh_hans: 同步中：%@
zh_hant: 同步中：%@

source: The Claude session was deleted. Recreate it from Codex, or unlink the pair.
zh_hans: Claude 这边的 session 已被删除。可以从 Codex 重建，或解除配对。
zh_hant: Claude 嗰邊嘅 session 已被刪除。可以由 Codex 重建，或者解除配對。

source: The Codex thread was deleted. Recreate it from Claude, or unlink the pair.
zh_hans: Codex 这边的 thread 已被删除。可以从 Claude 重建，或解除配对。
zh_hant: Codex 嗰邊嘅 thread 已被刪除。可以由 Claude 重建，或者解除配對。

source: The engine reported a status this app does not know. Update the app.
zh_hans: 引擎返回了未知状态，请更新 app。
zh_hant: 引擎回報咗一個新狀態，請更新 app。

source: The list shows when each conversation was last edited in Claude and in Codex, so you can see at a glance which side is newer.
zh_hans: 左侧列表会显示每个对话在 Claude 和 Codex 两边的最后编辑时间，哪边更新一目了然。
zh_hant: 左邊列表會顯示每個對話喺 Claude 同 Codex 兩邊嘅最後編輯時間，邊個新啲一目了然。

source: This conversation is open; try again later
zh_hans: 对话正在使用中，请稍后再试
zh_hant: 對話使用中，請稍後再試

source: Totals
zh_hans: 总数
zh_hant: 總數

source: Turns
zh_hans: 回合
zh_hant: 回合

source: Unknown
zh_hans: 未知
zh_hant: 未知

source: Unlink
zh_hans: 解除配对
zh_hant: 解除配對

source: Unlinked: %@
zh_hans: 已解除配对：%@
zh_hant: 已解除配對：%@

source: Unlinking…
zh_hans: 解除配对中…
zh_hant: 解除配對…

source: When on, every scan pushes newer turns to the other side (conflicts and open conversations are skipped)
zh_hans: 开启后每次扫描都会自动把较新的回合推送到另一边（冲突和正在使用的对话会跳过）
zh_hant: 開啟後每次掃描都會自動推送較新嘅回合去另一邊（衝突同使用中嘅對話會略過）

source: python3 path (empty = detect automatically)
zh_hans: python3 路径（留空自动查找）
zh_hant: python3 路徑（留空自動搵）

source: sessionsync.py path (empty = bundled)
zh_hans: sessionsync.py 路径（留空使用内置）
zh_hant: sessionsync.py 路徑（留空用 app 內置）
